#include <cstdio>
#include <cstring>

//1.注意定义二维字符串数组的时候，比如说，S12只有三个字符，但是却要定义成4位，因为最后还有一个'\0' 
//2.注意移动位置是最大的位置为54，即不是从0开始编码，而是从1开始--->注意题目 
 
int main(){
	
	char str1[100][4]={{"S1"},{"S2"},{"S3"},{"S4"},{"S5"},{"S6"},{"S7"},{"S8"},{"S9"},{"S10"},{"S11"},{"S12"},{"S13"},{"H1"},{"H2"},{"H3"},{"H4"},{"H5"},{"H6"},{"H7"},{"H8"},{"H9"},{"H10"},{"H11"},{"H12"},{"H13"},{"C1"},{"C2"},{"C3"},{"C4"},{"C5"},{"C6"},{"C7"},{"C8"},{"C9"},{"C10"},{"C11"},{"C12"},{"C13"},{"D1"},{"D2"},{"D3"},{"D4"},{"D5"},{"D6"},{"D7"},{"D8"},{"D9"},{"D10"},{"D11"},{"D12"},{"D13"},{"J1"},{"J2"}}; 		
	int i;

	char str2[100][4];	
	
	int array[54];
	int number ;
	scanf("%d",&number);
	
	//输入洗牌的顺序
	for(i = 0;i<54;i++){
		scanf("%d",&array[i]); 
	}
	
	while(number--){		
		//str2只是一个中间数组 
		for(i = 0;i<54;i++){
			strcpy(str2[array[i]-1] ,str1[i]);
		}
		
		//将正式答案放到str1中  
		for(i = 0;i<54;i++){
			strcpy(str1[i],str2[i]); 
			//printf("%s ",str2[i]);
		}
	}
	
	for(i = 0;i<54;i++){
		if(i!=53){
			printf("%s ",str1[i]);	
		}
		else{
			printf("%s",str1[i]);
		}
	}	
}

/**
36 52 37 38 3 39 40 53 54 41 
11 12 13 42 43 44 2 4 23 24 
25 26 27 6 7 8 48 49 50 51 
9 10 14 15 16 5 17 18 19 1
20 21 22 28 29 30 31 32 33 34
35 45 46 47

2
36 52 37 38 3 39 40 53 54 41 11 12 13 42 43 44 2 4 23 24 25 26 27 6 7 8 48 49 50 51 9 10 14 15 16 5 17 18 19 1 20 21 22 28 29 30 31 32 33 34 35 45 46 47

2
4 2 5 3 1
**/
